In [16]:
res = %sql select * from student;

 * sqlite:///sample2.db
   sqlite:///sample3.db
Done.

In [18]:
df = res.DataFrame()

In [20]:
df.describe()

              sid        Age
count    8.000000   8.000000
mean   275.000000  30.375000
std    122.474487  14.151603
min    100.000000  18.000000
25%    187.500000  19.750000
50%    275.000000  22.500000
75%    362.500000  43.250000
max    450.000000  50.000000